{
  "title": "Talks",
  "description": "A collection of my presentations, talks, and speaking engagements at conferences, workshops, and public events.",
  "talks": [
    {
      "title": "Assessing Explainability for AI Safety Governance",
      "authors": "M. Krutský, J. Němeček, P. Gürtler, J. Peleška, G. Šír",
      "date": "May 27, 2025",
      "venue": "International Conference on Large-Scale AI Risks, KU Leuven",
      "tags": ["Conference"],
      "description": "Presented our work on explainable AI assessment for AI safety governance. We proposed a 5-dimensional framework for evaluating explainable AI methods in safety contexts: understandability to subjects and auditors, veracity, actionability, and scalability. This framework addresses the challenge of specifying and enforcing safety criteria for AI models deployed in complex, dynamic environments. The approach enables stakeholders to react flexibly to emerging safety concerns through meaningful human oversight and technical explainability.",
      "links": [
        {
          "text": "Report",
          "icon": "fas fa-file-alt",
          "url": "https://rai.fel.cvut.cz/conferences/leuven/2025/05/27/leuven-risk/index.html"
        },
        {
          "text": "Book of abstracts",
          "icon": "fas fa-book",
          "url": "https://www.kuleuven.be/ethics-kuleuven/chair-ai/conference-ai-risks/xrisk-book_of_abstracts-1.pdf"
        }
      ]
    },
    {
      "title": "Dimensions of Explainability in AI Alignment",
      "authors": "M. Krutský, J. Němeček, J. Peleška, P. Gürtler",
      "date": "May 22, 2025",
      "venue": "29th International Student Scientific Conference (POSTER), Prague",
      "tags": ["Conference", "Poster"],
      "description": "Presented our work on human-AI alignment challenges and the role of explainability in continuous oversight. We argued that explainability is essential for bridging the gap between AI systems, governance, and human intervention, given the infeasibility of anticipating all potential misalignment risks. We proposed a structured framework for evaluating explainability methods that moves beyond narrow technical metrics to enhance AI accountability and alignment.",
      "links": [
        {
          "text": "Report",
          "icon": "fas fa-file-alt",
          "url": "https://rai.fel.cvut.cz/conferences/prague/2025/05/22/poster-xai-alignment/index.html"
        },
        {
          "text": "Proceedings",
          "icon": "fas fa-book",
          "url": "https://poster2025.sciencesconf.org/data/pages/POSTER_2025.pdf"
        }
      ]
    },
    {
      "title": "Ethics in AI Development",
      "authors": "J. Němeček, M. Krutský",
      "date": "October 18, 2024",
      "venue": "AI 4 ALL at AI Days 2024, Prague",
      "tags": ["Public Talk", "Education"],
      "description": "Gave two talks on the ethics of AI from the perspective of technical researchers and developers. The first talk was tailored to high school students in the morning, and the second talk was aimed at the general public in the late afternoon. Topics covered included AI alignment, RLHF, jailbreaking, constitutional AI, and measuring ethics and morality in LLMs.",
      "links": [
        {
          "text": "Report",
          "icon": "fas fa-file-alt",
          "url": "https://rai.fel.cvut.cz/events/prague/2024/10/18/aidev-ethics-talk-report/index.html"
        }
      ]
    },
    {
      "title": "Responsible AI in Prague",
      "authors": "Martin Krutský",
      "date": "November 3, 2023",
      "venue": "Seminar for AI Days 2023, Prague",
      "tags": ["Public Lecture"],
      "description": "Organized and presented at a seminar mapping the landscape of Responsible AI projects in Prague. More than 50 people concerned with the responsible development of AI technologies attended to listen and discuss the many different societal impacts of AI. The talk covered the definition of Responsible AI, mapping of RAI efforts in Prague, and the relationship between AI ethics and AI safety.",
      "links": [
        {
          "text": "Report",
          "icon": "fas fa-file-alt",
          "url": "https://rai.fel.cvut.cz/events/prague/2023/11/03/rai-talk-report/index.html"
        }
      ]
    }
  ]
} 